/*
 * Copyright (c) Hisilicon Technologies Co., Ltd. 2019-2019. All rights reserved.
 * Description: oal_completion.h
 * Author: Hisilicon
 * Create: 2020-01-09
 */

#ifndef __OAL_COMPLETION_H__
#define __OAL_COMPLETION_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include <linux/completion.h>

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  2 STRUCT定义
*****************************************************************************/
typedef struct completion oal_completion;

/*****************************************************************************
  3 枚举定义
*****************************************************************************/
/*****************************************************************************
  4 全局变量声明
*****************************************************************************/
/*****************************************************************************
  5 消息头定义
*****************************************************************************/
/*****************************************************************************
  6 消息定义
*****************************************************************************/
/*****************************************************************************
  7 宏定义
*****************************************************************************/
#define OAL_INIT_COMPLETION(_my_completion)     init_completion(_my_completion)
#define OAL_COMPLETE(_my_completion)            complete(_my_completion)
#define OAL_WAIT_FOR_COMPLETION(_my_completion) wait_for_completion(_my_completion)
#define OAL_COMPLETE_ALL(_my_completion)        complete_all(_my_completion)

/*****************************************************************************
  8 UNION定义
*****************************************************************************/
/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/
/*****************************************************************************
  10 函数声明
*****************************************************************************/
/*****************************************************************************
 功能描述  : 同步：等待超时检查
 输入参数  : 无
 输出参数  : 无
 返 回 值  : Return: 0 if timed out, and positive (at least 1, or number of jiffies left till timeout) if completed.
*****************************************************************************/
static inline hi_u32 oal_wait_for_completion_timeout(oal_completion *pst_completion, hi_u32 ul_timeout)
{
    return wait_for_completion_timeout(pst_completion, ul_timeout);
}

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif

#endif /* end of oal_completion.h */

